posts/2022-03-20-emacs-lsp-client-switch-from-lsp-mode-to-eglot.org
#+title: Emacs LSP 客户端，从 lsp-mode 迁移到 eglot
#+date: <2022-03-20 20:45>
#+description:
#+filetags: Emacs eglot lsp-mode

* TL;DR

前段时间 Eclipse JDTLS 在社区的呼吁下终于提供了一个简易的启动脚本，借此机会，在本周末我尝试下从 lsp-mode
迁移到 eglot，顺便记录一下遇到的一些问题和感想。

* 迁移的动机

lsp-mode 和 dap-mode 基本上已经在 Emacs 上还原了大部分 VSCode Language Server 上面的功能，
但让我不太满意的一点是，lsp-mode 配置比较复杂，需要在我看来是不重要的功能被默认开启，使用时需要我把很多不用的功能
手动关掉，而且性能上也存在问题。

* Eglot

实际上，迁移到 eglot 上的成本远低于我的预估，eglot 的代码质量很好，易于理解(3000行lisp)，在迁移的过程中我也学习到了很多 emacs-lisp 的知识。

** Language Server 安装

#+begin_src shell :results output
  tree -L 3 ~/.emacs.d/cache/language-server/
#+end_src

#+RESULTS:
#+begin_example
/home/zsxh/.emacs.d/cache/language-server/
├── bin
│   ├── clojure-lsp -> /home/zsxh/.emacs.d/cache/language-server/clojure/clojure-lsp
│   ├── jdtls -> /home/zsxh/.emacs.d/cache/language-server/java/jdtls/bin/jdtls
│   └── rust-analyzer -> /home/zsxh/.emacs.d/cache/language-server/rust/rust-analyzer
├── clojure
│   └── clojure-lsp
├── java
│   ├── bundles
│   │   ├── dg.jdt.ls.decompiler.cfr-0.0.3.jar
│   │   ├── dg.jdt.ls.decompiler.common-0.0.3.jar
│   │   ├── dg.jdt.ls.decompiler.fernflower-0.0.3.jar
│   │   └── dg.jdt.ls.decompiler.procyon-0.0.3.jar
│   ├── java-decompiler
│   │   ├── [Content_Types].xml
│   │   ├── extension
│   │   └── extension.vsixmanifest
│   └── jdtls
│       ├── bin
│       ├── config_linux
│       ├── config_mac
│       ├── config_ss_linux
│       ├── config_ss_mac
│       ├── config_ss_win
│       ├── config_win
│       ├── features
│       └── plugins
└── rust
    └── rust-analyzer

17 directories, 11 files
#+end_example

~/.emacs.d/cache/language-server/bin 加到 $PATH 当中，将各个 language server 链接到此目录下

