html/2022-03-20-emacs-lsp-client-switch-from-lsp-mode-to-eglot.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://zsxh.github.io/rss.xml"
      title="RSS feed for https://zsxh.github.io/">
<title>Emacs LSP 客户端，从 lsp-mode 迁移到 eglot</title>
<meta name="author" content="ZSXH">
<meta name="referrer" content="no-referrer">
<link href= "/static/style.css" rel="stylesheet" type="text/css" />
<link rel="stylesheet" href="/static/katex.min.css">
<meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8">
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1"></head>
<body>
<div id="preamble" class="status"><div class="header">
<a href="/index.html">Home</a> |
<a href="/archive.html">Archive</a> |
<a href="/html/resource.html">Resources</a> |
<a href="https://github.com/zsxh">Github</a> |
<a href="/about.html">About</a> |
<a href="/rss.xml">RSS</a>
</div></div>
<div id="content">
<h1 class="post-title"><a href="https://zsxh.github.io/html/2022-03-20-emacs-lsp-client-switch-from-lsp-mode-to-eglot.html">Emacs LSP 客户端，从 lsp-mode 迁移到 eglot</a></h1>
<div class="post-date"> Posted: 2022-03-20</div>
<div id="outline-container-orgd211f6b" class="outline-2">
<h2 id="orgd211f6b">TL;DR</h2>
<div class="outline-text-2" id="text-orgd211f6b">
<p>
前段时间 Eclipse JDTLS 在社区的呼吁下终于提供了一个简易的启动脚本，借此机会，在本周末我尝试下从 lsp-mode
迁移到 eglot，顺便记录一下遇到的一些问题和感想。
</p>
</div>
</div>

<div id="outline-container-orga4a1828" class="outline-2">
<h2 id="orga4a1828">迁移的动机</h2>
<div class="outline-text-2" id="text-orga4a1828">
<p>
lsp-mode 和 dap-mode 基本上已经在 Emacs 上还原了大部分 VSCode Lanuage Server 上面的功能，
但让我不太满意的一点是，lsp-mode 配置比较复杂，需要在我看来是不重要的功能被默认开启，使用时需要我把很多不用的功能
手动关掉，而且性能上也存在问题。
</p>
</div>
</div>

<div id="outline-container-org899b40d" class="outline-2">
<h2 id="org899b40d">Eglot</h2>
<div class="outline-text-2" id="text-org899b40d">
<p>
实际上，迁移到 eglot 上的成本远低于我的预估，eglot 的代码质量很好，易于理解(3000行lisp)，在迁移的过程中我也学习到了很多 emacs-lisp 的知识。
</p>
</div>

<div id="outline-container-org006dc27" class="outline-3">
<h3 id="org006dc27">Language Server 安装</h3>
<div class="outline-text-3" id="text-org006dc27">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #268bd2; background-color: #f9f6ed; font-weight: bold;">tree</span> <span style="color: #6c71c4; font-weight: bold;">-L</span> 3 ~/.emacs.d/cache/language-server/
</pre>
</div>

<pre class="example" id="org6700508">
/home/zsxh/.emacs.d/cache/language-server/
├── bin
│   ├── clojure-lsp -&gt; /home/zsxh/.emacs.d/cache/language-server/clojure/clojure-lsp
│   ├── jdtls -&gt; /home/zsxh/.emacs.d/cache/language-server/java/jdtls/bin/jdtls
│   └── rust-analyzer -&gt; /home/zsxh/.emacs.d/cache/language-server/rust/rust-analyzer
├── clojure
│   └── clojure-lsp
├── java
│   ├── bundles
│   │   ├── dg.jdt.ls.decompiler.cfr-0.0.3.jar
│   │   ├── dg.jdt.ls.decompiler.common-0.0.3.jar
│   │   ├── dg.jdt.ls.decompiler.fernflower-0.0.3.jar
│   │   └── dg.jdt.ls.decompiler.procyon-0.0.3.jar
│   ├── java-decompiler
│   │   ├── [Content_Types].xml
│   │   ├── extension
│   │   └── extension.vsixmanifest
│   └── jdtls
│       ├── bin
│       ├── config_linux
│       ├── config_mac
│       ├── config_ss_linux
│       ├── config_ss_mac
│       ├── config_ss_win
│       ├── config_win
│       ├── features
│       └── plugins
└── rust
    └── rust-analyzer

17 directories, 11 files
</pre>

<p>
~/.emacs.d/cache/language-server/bin 加到 $PATH 当中，将各个 language server 链接到此目录下
</p>
</div>
</div>
