posts/2022-03-20-emacs-lsp-client-switch-from-lsp-mode-to-eglot.org
** eglot 基本配置

#+begin_src emacs-lisp
  (require 'eglot)

  ;; 定义启动命令和参数
  (add-to-list 'eglot-server-programs
                 `(java-mode "jdtls"
                             "-configuration" ,(expand-file-name "cache/language-server/java/jdtls/config_linux" user-emacs-directory)
                             "-data" ,(expand-file-name "cache/java-workspace" user-emacs-directory)
                             ,(concat "--jvm-arg=-javaagent:" (expand-file-name "~/.m2/repository/org/projectlombok/lombok/1.18.20/lombok-1.18.20.jar"))))

  ;; 服务端启动成功后，客户端需要传一些初始化参数给服务端，相关参数在各自的服务端github上面找
  (cl-defmethod eglot-initialization-options ((server eglot-lsp-server) &context (major-mode java-mode))
    `(:settings
      (:java
       (:configuration
        (:runtime [(:name "JavaSE-1.8" :path "/usr/local/jdk-8")
                   (:name "JavaSE-11" :path "/usr/local/graalvm-ce-java11-22.0.0.2")
                   (:name "JavaSE-17" :path "/usr/local/graalvm-ce-java17-22.0.0.2" :default t)])
        :format (:settings (:url ,(expand-file-name (locate-user-emacs-file "cache/eclipse-java-google-style.xml"))
                                 :profile "GoogleStyle"))
        ;; NOTE: https://github.com/redhat-developer/vscode-java/issues/406#issuecomment-356303715
        ;; > We enabled it by default so that workspace-wide errors can be reported (eg. removing a public method in one class would cause compilation errors in other files consuming that method).
        ;; for large workspaces, it may make sense to be able to disable autobuild if it negatively impacts performance.
        :autobuild (:enabled t)
        ;; https://github.com/dgileadi/vscode-java-decompiler
        :contentProvider (:preferred "fernflower")))
      ;; support non standard LSP `java/classFileContents', `Location' items that have a `jdt://...' uri
      ;; https://github.com/eclipse/eclipse.jdt.ls/issues/1384
      :extendedClientCapabilities (:classFileContentsSupport t)
      ;; bundles: decompilers, etc.
      ;; https://github.com/dgileadi/dg.jdt.ls.decompiler
      :bundles ,(let ((bundles-dir (expand-file-name (locate-user-emacs-file "cache/language-server/java/bundles" user-emacs-directory)))
                      jdtls-bundles)
                  (->> (when (file-directory-p bundles-dir)
                         (directory-files bundles-dir t "\\.jar$"))
                       (append jdtls-bundles)
                       (apply #'vector)))))
#+end_src

