html/2022-03-20-emacs-lsp-client-switch-from-lsp-mode-to-eglot.html

<div id="outline-container-org74011f1" class="outline-3">
<h3 id="org74011f1">eglot 基本配置</h3>
<div class="outline-text-3" id="text-org74011f1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">require</span> '<span style="color: #6c71c4; font-weight: bold;">eglot</span><span style="color: #268bd2;">)</span>

<span style="color: #96A7A9; font-style: italic;">;; </span><span style="color: #96A7A9; font-style: italic;">&#23450;&#20041;&#21551;&#21160;&#21629;&#20196;&#21644;&#21442;&#25968;</span>
<span style="color: #268bd2;">(</span><span style="color: #6c71c4; font-weight: bold;">add-to-list</span> '<span style="color: #268bd2;">eglot-server-programs</span>
               `<span style="color: #d33682;">(</span><span style="color: #b58900; background-color: #f9f6ed;">java-mode</span> <span style="color: #2aa198;">"jdtls"</span>
                           <span style="color: #2aa198;">"-configuration"</span> ,<span style="color: #859900;">(</span><span style="color: #6c71c4; font-weight: bold;">expand-file-name</span> <span style="color: #2aa198;">"cache/language-server/java/jdtls/config_linux"</span> <span style="color: #268bd2;">user-emacs-directory</span><span style="color: #859900;">)</span>
                           <span style="color: #2aa198;">"-data"</span> ,<span style="color: #859900;">(</span><span style="color: #6c71c4; font-weight: bold;">expand-file-name</span> <span style="color: #2aa198;">"cache/java-workspace"</span> <span style="color: #268bd2;">user-emacs-directory</span><span style="color: #859900;">)</span>
                           ,<span style="color: #859900;">(</span><span style="color: #6c71c4; font-weight: bold;">concat</span> <span style="color: #2aa198;">"--jvm-arg=-javaagent:"</span> <span style="color: #6c71c4;">(</span><span style="color: #6c71c4; font-weight: bold;">expand-file-name</span> <span style="color: #2aa198;">"~/.m2/repository/org/projectlombok/lombok/1.18.20/lombok-1.18.20.jar"</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>

<span style="color: #96A7A9; font-style: italic;">;; </span><span style="color: #96A7A9; font-style: italic;">&#26381;&#21153;&#31471;&#21551;&#21160;&#25104;&#21151;&#21518;&#65292;&#23458;&#25143;&#31471;&#38656;&#35201;&#20256;&#19968;&#20123;&#21021;&#22987;&#21270;&#21442;&#25968;&#32473;&#26381;&#21153;&#31471;&#65292;&#30456;&#20851;&#21442;&#25968;&#22312;&#21508;&#33258;&#30340;&#26381;&#21153;&#31471;github&#19978;&#38754;&#25214;</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">cl-defmethod</span> <span style="color: #b58900; background-color: #f9f6ed;">eglot-initialization-options</span> <span style="color: #d33682;">(</span><span style="color: #859900;">(</span>server eglot-lsp-server<span style="color: #859900;">)</span> <span style="color: #b58900; font-style: italic;">&amp;context</span> <span style="color: #859900;">(</span>major-mode java-mode<span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
  `<span style="color: #d33682;">(</span><span style="color: #d33682; font-style: italic;">:settings</span>
    <span style="color: #859900;">(</span><span style="color: #d33682; font-style: italic;">:java</span>
     <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-style: italic;">:configuration</span>
      <span style="color: #35a69c;">(</span><span style="color: #d33682; font-style: italic;">:runtime</span> <span style="color: #268bd2;">[</span><span style="color: #d33682;">(</span><span style="color: #d33682; font-style: italic;">:name</span> <span style="color: #2aa198;">"JavaSE-1.8"</span> <span style="color: #268bd2;">:path</span> <span style="color: #2aa198;">"/usr/local/jdk-8"</span><span style="color: #d33682;">)</span>
                 <span style="color: #d33682;">(</span><span style="color: #d33682; font-style: italic;">:name</span> <span style="color: #2aa198;">"JavaSE-11"</span> <span style="color: #268bd2;">:path</span> <span style="color: #2aa198;">"/usr/local/graalvm-ce-java11-22.0.0.2"</span><span style="color: #d33682;">)</span>
                 <span style="color: #d33682;">(</span><span style="color: #d33682; font-style: italic;">:name</span> <span style="color: #2aa198;">"JavaSE-17"</span> <span style="color: #268bd2;">:path</span> <span style="color: #2aa198;">"/usr/local/graalvm-ce-java17-22.0.0.2"</span> <span style="color: #268bd2;">:default</span> t<span style="color: #d33682;">)</span><span style="color: #268bd2;">]</span><span style="color: #35a69c;">)</span>
      <span style="color: #268bd2;">:format</span> <span style="color: #35a69c;">(</span><span style="color: #d33682; font-style: italic;">:settings</span> <span style="color: #268bd2;">(</span><span style="color: #d33682; font-style: italic;">:url</span> ,<span style="color: #d33682;">(</span><span style="color: #6c71c4; font-weight: bold;">expand-file-name</span> <span style="color: #859900;">(</span><span style="color: #6c71c4; font-weight: bold;">locate-user-emacs-file</span> <span style="color: #2aa198;">"cache/eclipse-java-google-style.xml"</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
                               <span style="color: #268bd2;">:profile</span> <span style="color: #2aa198;">"GoogleStyle"</span><span style="color: #268bd2;">)</span><span style="color: #35a69c;">)</span>
      <span style="color: #96A7A9; font-style: italic;">;; </span><span style="color: #863927; font-style: italic;">NOTE</span><span style="color: #96A7A9; font-style: italic;">: https://github.com/redhat-developer/vscode-java/issues/406#issuecomment-356303715</span>
      <span style="color: #96A7A9; font-style: italic;">;; </span><span style="color: #96A7A9; font-style: italic;">&gt; We enabled it by default so that workspace-wide errors can be reported (eg. removing a public method in one class would cause compilation errors in other files consuming that method).</span>
      <span style="color: #96A7A9; font-style: italic;">;; </span><span style="color: #96A7A9; font-style: italic;">for large workspaces, it may make sense to be able to disable autobuild if it negatively impacts performance.</span>
      <span style="color: #268bd2;">:autobuild</span> <span style="color: #35a69c;">(</span><span style="color: #d33682; font-style: italic;">:enabled</span> t<span style="color: #35a69c;">)</span>
      <span style="color: #96A7A9; font-style: italic;">;; </span><span style="color: #96A7A9; font-style: italic;">https://github.com/dgileadi/vscode-java-decompiler</span>
      <span style="color: #268bd2;">:contentProvider</span> <span style="color: #35a69c;">(</span><span style="color: #d33682; font-style: italic;">:preferred</span> <span style="color: #2aa198;">"fernflower"</span><span style="color: #35a69c;">)</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span>
    <span style="color: #96A7A9; font-style: italic;">;; </span><span style="color: #96A7A9; font-style: italic;">support non standard LSP `</span><span style="color: #6c71c4; font-weight: bold; font-style: italic;">java/classFileContents</span><span style="color: #96A7A9; font-style: italic;">', `</span><span style="color: #6c71c4; font-weight: bold; font-style: italic;">Location</span><span style="color: #96A7A9; font-style: italic;">' items that have a `</span><span style="color: #6c71c4; font-weight: bold; font-style: italic;">jdt://...</span><span style="color: #96A7A9; font-style: italic;">' uri</span>
    <span style="color: #96A7A9; font-style: italic;">;; </span><span style="color: #96A7A9; font-style: italic;">https://github.com/eclipse/eclipse.jdt.ls/issues/1384</span>
    <span style="color: #268bd2;">:extendedClientCapabilities</span> <span style="color: #859900;">(</span><span style="color: #d33682; font-style: italic;">:classFileContentsSupport</span> t<span style="color: #859900;">)</span>
    <span style="color: #96A7A9; font-style: italic;">;; </span><span style="color: #96A7A9; font-style: italic;">bundles: decompilers, etc.</span>
    <span style="color: #96A7A9; font-style: italic;">;; </span><span style="color: #96A7A9; font-style: italic;">https://github.com/dgileadi/dg.jdt.ls.decompiler</span>
    <span style="color: #268bd2;">:bundles</span> ,<span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">let</span> <span style="color: #6c71c4;">(</span><span style="color: #35a69c;">(</span>bundles-dir <span style="color: #268bd2;">(</span><span style="color: #6c71c4; font-weight: bold;">expand-file-name</span> <span style="color: #d33682;">(</span><span style="color: #6c71c4; font-weight: bold;">locate-user-emacs-file</span> <span style="color: #2aa198;">"cache/language-server/java/bundles"</span> <span style="color: #268bd2;">user-emacs-directory</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span><span style="color: #35a69c;">)</span>
                    jdtls-bundles<span style="color: #6c71c4;">)</span>
                <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">-&gt;&gt;</span> <span style="color: #35a69c;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">when</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4; font-weight: bold;">file-directory-p</span> bundles-dir<span style="color: #268bd2;">)</span>
                       <span style="color: #268bd2;">(</span><span style="color: #6c71c4; font-weight: bold;">directory-files</span> bundles-dir t <span style="color: #2aa198;">"\\.jar$"</span><span style="color: #268bd2;">)</span><span style="color: #35a69c;">)</span>
                     <span style="color: #35a69c;">(</span><span style="color: #6c71c4; font-weight: bold;">append</span> jdtls-bundles<span style="color: #35a69c;">)</span>
                     <span style="color: #35a69c;">(</span><span style="color: #6c71c4; font-weight: bold;">apply</span> #'vector<span style="color: #35a69c;">)</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</div>
