html/2022-03-20-emacs-lsp-client-switch-from-lsp-mode-to-eglot.html

<div id="outline-container-org1b7cbdf" class="outline-3">
<h3 id="org1b7cbdf">Eglot 支持扩展</h3>
<div class="outline-text-3" id="text-org1b7cbdf">
<p>
需要注意的是，eglot 只实现了 LSP 的标准协议，向 jdtls 的 <code>jdt://</code>, clojure 的 <code>jar:file://</code> 和 <code>zipfile://</code>
等扩展 uri scheme 是不支持的，这块功能比较简单，周末花了点时间去实现。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #96A7A9; font-style: italic;">;; </span><span style="color: #96A7A9; font-style: italic;">https://github.com/joaotavora/eglot/discussions/888#discussioncomment-2386710</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">cl-defmethod</span> <span style="color: #b58900; background-color: #f9f6ed;">eglot-execute-command</span>
  <span style="color: #d33682;">(</span>_server <span style="color: #859900;">(</span>_cmd <span style="color: #6c71c4;">(</span><span style="color: #6c71c4; font-weight: bold;">eql</span> java.apply.workspaceEdit<span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span> arguments<span style="color: #d33682;">)</span>
  <span style="color: #35a69c; font-style: italic;">"Eclipse JDT breaks spec and replies with edits as arguments."</span>
  <span style="color: #d33682;">(</span><span style="color: #6c71c4; font-weight: bold;">mapc</span> #'eglot--apply-workspace-edit arguments<span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>

<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">cl-defgeneric</span> <span style="color: #b58900; background-color: #f9f6ed;">+eglot/ext-uri-to-path</span> <span style="color: #d33682;">(</span>uri<span style="color: #d33682;">)</span>
  <span style="color: #35a69c; font-style: italic;">"Support extension uri."</span>
  nil<span style="color: #268bd2;">)</span>

<span style="color: #96A7A9; font-style: italic;">;; </span><span style="color: #96A7A9; font-style: italic;">https://github.com/eclipse/eclipse.jdt.ls/blob/b4e5cb4b693d5d503d90be89b0b9a8abe9db41a5/org.eclipse.jdt.ls.core/src/org/eclipse/jdt/ls/core/internal/JDTUtils.java#L809</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">cl-defmethod</span> <span style="color: #b58900; background-color: #f9f6ed;">+eglot/ext-uri-to-path</span> <span style="color: #d33682;">(</span>uri <span style="color: #b58900; font-style: italic;">&amp;context</span> <span style="color: #859900;">(</span>major-mode java-mode<span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
  <span style="color: #35a69c; font-style: italic;">"Support Eclipse jdtls `</span><span style="color: #6c71c4; font-weight: bold; font-style: italic;">jdt://</span><span style="color: #35a69c; font-style: italic;">' uri scheme."</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">when-let*</span> <span style="color: #859900;">(</span><span style="color: #6c71c4;">(</span>jdt-scheme-p <span style="color: #35a69c;">(</span><span style="color: #6c71c4; font-weight: bold;">string-prefix-p</span> <span style="color: #2aa198;">"jdt://"</span> uri<span style="color: #35a69c;">)</span><span style="color: #6c71c4;">)</span>
              <span style="color: #6c71c4;">(</span>filename <span style="color: #35a69c;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">save-match-data</span>
                          <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">when</span> <span style="color: #d33682;">(</span><span style="color: #6c71c4; font-weight: bold;">string-match</span> <span style="color: #2aa198;">"jdt://contents/</span><span style="color: #268bd2; font-weight: bold;">\\</span><span style="color: #268bd2; font-weight: bold;">(</span><span style="color: #2aa198;">.*?</span><span style="color: #268bd2; font-weight: bold;">\\</span><span style="color: #268bd2; font-weight: bold;">)</span><span style="color: #2aa198;">/</span><span style="color: #268bd2; font-weight: bold;">\\</span><span style="color: #268bd2; font-weight: bold;">(</span><span style="color: #2aa198;">.*</span><span style="color: #268bd2; font-weight: bold;">\\</span><span style="color: #268bd2; font-weight: bold;">)</span><span style="color: #b58900;">\</span><span style="color: #2aa198;">.class\\?"</span> uri<span style="color: #d33682;">)</span>
                            <span style="color: #d33682;">(</span><span style="color: #6c71c4; font-weight: bold;">format</span> <span style="color: #2aa198;">"%s.java"</span>
                                    <span style="color: #859900;">(</span><span style="color: #6c71c4; font-weight: bold;">replace-regexp-in-string</span> <span style="color: #2aa198;">"/"</span> <span style="color: #2aa198;">"."</span> <span style="color: #6c71c4;">(</span><span style="color: #6c71c4; font-weight: bold;">match-string</span> 2 uri<span style="color: #6c71c4;">)</span> t t<span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span><span style="color: #35a69c;">)</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span>
    <span style="color: #859900;">(</span><span style="color: #b58900; background-color: #f9f6ed;">+eglot/create-source-file</span> <span style="color: #268bd2;">:java/classFileContents</span> uri filename<span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>

<span style="color: #96A7A9; font-style: italic;">;; </span><span style="color: #96A7A9; font-style: italic;">https://github.com/emacs-lsp/lsp-mode/blob/d3bc47bde5ffc1bace40122a6ec0c6d8b9e84500/clients/lsp-clojure.el#L272</span>
<span style="color: #96A7A9; font-style: italic;">;; </span><span style="color: #96A7A9; font-style: italic;">https://github.com/clojure-lsp/clojure-lsp/blob/master/lib/test/clojure_lsp/shared_test.clj</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">cl-defmethod</span> <span style="color: #b58900; background-color: #f9f6ed;">+eglot/ext-uri-to-path</span> <span style="color: #d33682;">(</span>uri <span style="color: #b58900; font-style: italic;">&amp;context</span> <span style="color: #859900;">(</span>major-mode clojure-mode<span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
  <span style="color: #35a69c; font-style: italic;">"Support Clojure-lsp `</span><span style="color: #6c71c4; font-weight: bold; font-style: italic;">zifile://</span><span style="color: #35a69c; font-style: italic;">', `</span><span style="color: #6c71c4; font-weight: bold; font-style: italic;">jar:file://</span><span style="color: #35a69c; font-style: italic;">' uri scheme."</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">when-let*</span> <span style="color: #859900;">(</span><span style="color: #6c71c4;">(</span>clj-scheme-p <span style="color: #35a69c;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">or</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4; font-weight: bold;">string-prefix-p</span> <span style="color: #2aa198;">"jar:file://"</span> uri<span style="color: #268bd2;">)</span>
                                <span style="color: #268bd2;">(</span><span style="color: #6c71c4; font-weight: bold;">string-prefix-p</span> <span style="color: #2aa198;">"zipfile://"</span> uri<span style="color: #268bd2;">)</span><span style="color: #35a69c;">)</span><span style="color: #6c71c4;">)</span>
              <span style="color: #6c71c4;">(</span>filename <span style="color: #35a69c;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">when</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4; font-weight: bold;">string-match</span> <span style="color: #2aa198;">"^</span><span style="color: #268bd2; font-weight: bold;">\\</span><span style="color: #268bd2; font-weight: bold;">(</span><span style="color: #2aa198;">jar:file</span><span style="color: #268bd2; font-weight: bold;">\\</span><span style="color: #268bd2; font-weight: bold;">|</span><span style="color: #2aa198;">zipfile</span><span style="color: #268bd2; font-weight: bold;">\\</span><span style="color: #268bd2; font-weight: bold;">)</span><span style="color: #2aa198;">://.+</span><span style="color: #268bd2; font-weight: bold;">\\</span><span style="color: #268bd2; font-weight: bold;">(</span><span style="color: #2aa198;">!/</span><span style="color: #268bd2; font-weight: bold;">\\</span><span style="color: #268bd2; font-weight: bold;">|</span><span style="color: #2aa198;">::</span><span style="color: #268bd2; font-weight: bold;">\\</span><span style="color: #268bd2; font-weight: bold;">)</span><span style="color: #268bd2; font-weight: bold;">\\</span><span style="color: #268bd2; font-weight: bold;">(</span><span style="color: #2aa198;">.+</span><span style="color: #268bd2; font-weight: bold;">\\</span><span style="color: #268bd2; font-weight: bold;">)</span><span style="color: #2aa198;">"</span> uri<span style="color: #268bd2;">)</span>
                          <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">let*</span> <span style="color: #d33682;">(</span><span style="color: #859900;">(</span>ns-path <span style="color: #6c71c4;">(</span><span style="color: #6c71c4; font-weight: bold;">match-string</span> 3 uri<span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span>
                                 <span style="color: #859900;">(</span>filename <span style="color: #6c71c4;">(</span><span style="color: #6c71c4; font-weight: bold;">replace-regexp-in-string</span> <span style="color: #2aa198;">"/"</span> <span style="color: #2aa198;">"."</span> ns-path<span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
                            filename<span style="color: #268bd2;">)</span><span style="color: #35a69c;">)</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span>
    <span style="color: #859900;">(</span><span style="color: #b58900; background-color: #f9f6ed;">+eglot/create-source-file</span> <span style="color: #268bd2;">:clojure/dependencyContents</span> uri filename<span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>

<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">defun</span> <span style="color: #b58900; background-color: #f9f6ed;">+eglot/create-source-file</span> <span style="color: #d33682;">(</span>method uri filename<span style="color: #d33682;">)</span>
  <span style="color: #35a69c; font-style: italic;">"Create source file and metadata in project root .eglot directory."</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">let*</span> <span style="color: #859900;">(</span><span style="color: #6c71c4;">(</span>cache-dir <span style="color: #35a69c;">(</span><span style="color: #6c71c4; font-weight: bold;">file-name-concat</span> <span style="color: #268bd2;">(</span><span style="color: #b58900; background-color: #f9f6ed;">project-root</span> <span style="color: #d33682;">(</span><span style="color: #6c71c4; font-weight: bold;">eglot--current-project</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span> <span style="color: #2aa198;">".eglot"</span><span style="color: #35a69c;">)</span><span style="color: #6c71c4;">)</span>
         <span style="color: #6c71c4;">(</span>source-file <span style="color: #35a69c;">(</span><span style="color: #6c71c4; font-weight: bold;">expand-file-name</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4; font-weight: bold;">file-name-concat</span> cache-dir filename<span style="color: #268bd2;">)</span><span style="color: #35a69c;">)</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span>
    <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">unless</span> <span style="color: #6c71c4;">(</span><span style="color: #6c71c4; font-weight: bold;">file-readable-p</span> source-file<span style="color: #6c71c4;">)</span>
      <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">let</span> <span style="color: #35a69c;">(</span><span style="color: #268bd2;">(</span>content <span style="color: #d33682;">(</span><span style="color: #6c71c4; font-weight: bold;">jsonrpc-request</span> <span style="color: #859900;">(</span><span style="color: #6c71c4; font-weight: bold;">eglot--current-server-or-lose</span><span style="color: #859900;">)</span> method <span style="color: #859900;">(</span><span style="color: #6c71c4; font-weight: bold;">list</span> <span style="color: #268bd2;">:uri</span> uri<span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
            <span style="color: #268bd2;">(</span>metadata-file <span style="color: #d33682;">(</span><span style="color: #b58900; background-color: #f9f6ed;">+eglot/path-to-metadata-file</span> source-file<span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span><span style="color: #35a69c;">)</span>
        <span style="color: #35a69c;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">unless</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4; font-weight: bold;">file-directory-p</span> cache-dir<span style="color: #268bd2;">)</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4; font-weight: bold;">make-directory</span> cache-dir t<span style="color: #268bd2;">)</span><span style="color: #35a69c;">)</span>
        <span style="color: #35a69c;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">with-temp-file</span> source-file <span style="color: #268bd2;">(</span><span style="color: #6c71c4; font-weight: bold;">insert</span> content<span style="color: #268bd2;">)</span><span style="color: #35a69c;">)</span>
        <span style="color: #35a69c;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">with-temp-file</span> metadata-file <span style="color: #268bd2;">(</span><span style="color: #6c71c4; font-weight: bold;">insert</span> uri<span style="color: #268bd2;">)</span><span style="color: #35a69c;">)</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span>
    source-file<span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>

<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">defun</span> <span style="color: #b58900; background-color: #f9f6ed;">+eglot/path-to-metadata-file</span> <span style="color: #d33682;">(</span>path<span style="color: #d33682;">)</span>
  <span style="color: #d33682;">(</span><span style="color: #6c71c4; font-weight: bold;">format</span> <span style="color: #2aa198;">"%s.%s.metadata"</span> <span style="color: #859900;">(</span><span style="color: #6c71c4; font-weight: bold;">file-name-directory</span> path<span style="color: #859900;">)</span> <span style="color: #859900;">(</span><span style="color: #6c71c4; font-weight: bold;">file-name-base</span> path<span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>

<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">defun</span> <span style="color: #b58900; background-color: #f9f6ed;">+eglot/path-to-ext-uri</span> <span style="color: #d33682;">(</span>path<span style="color: #d33682;">)</span>
  <span style="color: #35a69c; font-style: italic;">"Retrieve extension uri from metadata."</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">let</span> <span style="color: #859900;">(</span><span style="color: #6c71c4;">(</span>metadata-file <span style="color: #35a69c;">(</span><span style="color: #b58900; background-color: #f9f6ed;">+eglot/path-to-metadata-file</span> path<span style="color: #35a69c;">)</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span>
    <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">when</span> <span style="color: #6c71c4;">(</span><span style="color: #6c71c4; font-weight: bold;">file-exists-p</span> metadata-file<span style="color: #6c71c4;">)</span>
      <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">with-temp-buffer</span>
        <span style="color: #35a69c;">(</span><span style="color: #6c71c4; font-weight: bold;">insert-file-contents</span> metadata-file<span style="color: #35a69c;">)</span>
        <span style="color: #35a69c;">(</span><span style="color: #6c71c4; font-weight: bold;">buffer-string</span><span style="color: #35a69c;">)</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>

<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">define-advice</span> <span style="color: #b58900; background-color: #f9f6ed;">eglot--uri-to-path</span> <span style="color: #d33682;">(</span><span style="color: #d33682; font-style: italic;">:around</span> <span style="color: #859900;">(</span>orig-fn uri<span style="color: #859900;">)</span> advice<span style="color: #d33682;">)</span>
  <span style="color: #35a69c; font-style: italic;">"Support non standard LSP uri scheme."</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">or</span> <span style="color: #859900;">(</span><span style="color: #b58900; background-color: #f9f6ed;">+eglot/ext-uri-to-path</span> uri<span style="color: #859900;">)</span>
      <span style="color: #859900;">(</span><span style="color: #6c71c4; font-weight: bold;">funcall</span> orig-fn uri<span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>

<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">define-advice</span> <span style="color: #b58900; background-color: #f9f6ed;">eglot--path-to-uri</span> <span style="color: #d33682;">(</span><span style="color: #d33682; font-style: italic;">:around</span> <span style="color: #859900;">(</span>orig-fn path<span style="color: #859900;">)</span> advice<span style="color: #d33682;">)</span>
  <span style="color: #35a69c; font-style: italic;">"Support non standard LSP uri scheme."</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">or</span> <span style="color: #859900;">(</span><span style="color: #b58900; background-color: #f9f6ed;">+eglot/path-to-ext-uri</span> path<span style="color: #859900;">)</span>
      <span style="color: #859900;">(</span><span style="color: #6c71c4; font-weight: bold;">funcall</span> orig-fn path<span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>

<p>
分别对 <code>eglot--uri-to-path</code>, <code>eglot--path-to-uri</code> 这两个方法做了增强，这也是我喜欢 Emacs 的一个原因，
使用者非常容易获取源码并对其进行修改。
</p>
</div>
</div>
</div>
